server/tags/1.7.18/sql/testdata/soapxml/getSubdivisionList_v1.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:dhl="http://producers.dhl.xtee.riik.ee/producer/dhl"
  xmlns:xtee="http://x-tee.riik.ee/xsd/xtee.xsd"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/">  
	<env:Header>
		<xtee:asutus>70006317</xtee:asutus>
		<xtee:andmekogu>dhl</xtee:andmekogu>
		<xtee:ametnik>12345678901</xtee:ametnik>
		<xtee:nimi>dhl.getSubdivisionList.v1</xtee:nimi>
		<xtee:id>dhl_client_1</xtee:id>
		<xtee:toimik/>
		<xtee:isikukood>EE38806190294</xtee:isikukood>
	</env:Header>
	<env:Body>
		<dhl:getSubdivisionList>
			<keha xsi:type="SOAP-ENC:Array" SOAP-ENC:arrayType="xsd:string[3]">
				<asutus>70006317</asutus>
				<asutus>adit</asutus>
				<asutus>10839212</asutus>
			</keha>
		</dhl:getSubdivisionList>
	</env:Body>
</env:Envelope>
